 identification division.
 program-id. conditional.
 environment division.
 data division.
 working-storage section.
 01 xnum1 pic 9(3).
 01 xnum1 pic 9(3).
